temp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://v20.shipping.ws.lms.italogistics.com/" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<soapenv:Header>
<oas:Security>
<oas:usernameToken>
<oas:apiId>paUyFcmBb2bGAALbDOLUYE33EcUwpQFY</oas:apiId>
<oas:apiPassword>U2ZVXqRm1Ky+JL76SoN+JM9xow!vBUtB</oas:apiPassword>
</oas:usernameToken>
</oas:Security>
</soapenv:Header>
<soapenv:Body>
<ws:AvailableServicesRequest>
<clientInfo>
<version>2.0</version>
<language>en</language>
</clientInfo>
<pickupAddress>
<countryCode>de</countryCode>
<zip>20140</zip>
<city>Hamburg</city>
<street>Sender Street</street>
<company>SenderCompany</company>
<lastName>Sender</lastName>
<phoneNumber>100100100</phoneNumber>
<phonePrefix>+49</phonePrefix>
<email>alice.sender@sendercompany.xyz</email>
</pickupAddress>
</ws:AvailableServicesRequest>
</soapenv:Body>
</soapenv:Envelope>

OK